
<!DOCTYPE HTML>
<html lang="zh-hans" >
    <head>
        <meta charset="UTF-8">
        <meta content="text/html; charset=utf-8" http-equiv="Content-Type">
        <title>前言 · Cornerstone源码解析</title>
        <meta http-equiv="X-UA-Compatible" content="IE=edge" />
        <meta name="description" content="">
        <meta name="generator" content="GitBook 3.2.3">
        <meta name="author" content="HarryChen">
        
        
    
    <link rel="stylesheet" href="gitbook/style.css">

    
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-highlight/website.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-search/search.css">
                
            
                
                <link rel="stylesheet" href="gitbook/gitbook-plugin-fontsettings/website.css">
                
            
        

    

    
        
    

        
    
    
    <meta name="HandheldFriendly" content="true"/>
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <link rel="apple-touch-icon-precomposed" sizes="152x152" href="gitbook/images/apple-touch-icon-precomposed-152.png">
    <link rel="shortcut icon" href="gitbook/images/favicon.ico" type="image/x-icon">

    
    <link rel="next" href="introduction/" />
    
    

    </head>
    <body>
        
<div class="book">
    <div class="book-summary">
        
            
<div id="book-search-input" role="search">
    <input type="text" placeholder="输入并搜索" />
</div>

            
                <nav role="navigation">
                


<ul class="summary">
    
    

    

    
        
        
    
        <li class="chapter active" data-level="1.1" data-path="./">
            
                <a href="./">
            
                    
                    前言
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.2" data-path="introduction/">
            
                <a href="introduction/">
            
                    
                    总览
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3" data-path="core/">
            
                <a href="core/">
            
                    
                    Conerstone Core
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1" >
            
                <span>
            
                    
                    概念
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.1.1" data-path="core/concepts/enabledElement.html">
            
                <a href="core/concepts/enabledElement.html">
            
                    
                    Enabled Element
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.2" data-path="core/concepts/imageIds.html">
            
                <a href="core/concepts/imageIds.html">
            
                    
                    Image Ids
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.3" data-path="core/concepts/imageLoaders.html">
            
                <a href="core/concepts/imageLoaders.html">
            
                    
                    Image Loaders
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.4" data-path="core/concepts/viewports.html">
            
                <a href="core/concepts/viewports.html">
            
                    
                    Viewports
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.5" data-path="core/concepts/images.html">
            
                <a href="core/concepts/images.html">
            
                    
                    Images
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.6" data-path="core/concepts/pixelCoordinateSystem.html">
            
                <a href="core/concepts/pixelCoordinateSystem.html">
            
                    
                    Pixel Coordinate System
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.7" data-path="core/concepts/renderingLoop.html">
            
                <a href="core/concepts/renderingLoop.html">
            
                    
                    Rendering Loop
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.8" data-path="core/concepts/renderingPipeline.html">
            
                <a href="core/concepts/renderingPipeline.html">
            
                    
                    Rendering Pipeline
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.9" data-path="core/concepts/metadataProviders.html">
            
                <a href="core/concepts/metadataProviders.html">
            
                    
                    Metadata Providers
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.10" data-path="core/concepts/imageCache.html">
            
                <a href="core/concepts/imageCache.html">
            
                    
                    Image Cache
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.1.11" data-path="core/concepts/modalityLUTandVoiLUT.html">
            
                <a href="core/concepts/modalityLUTandVoiLUT.html">
            
                    
                    Modality LUT and VOI LUT
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.3.2" >
            
                <span>
            
                    
                    分析
            
                </span>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.3.2.1" data-path="core/analysis/howToTransformCoordinate.html">
            
                <a href="core/analysis/howToTransformCoordinate.html">
            
                    
                    如何实现坐标系转换
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2.2" data-path="core/analysis/howToRender.html">
            
                <a href="core/analysis/howToRender.html">
            
                    
                    渲染过程发生了什么
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2.3" data-path="core/analysis/howToCacheImage.html">
            
                <a href="core/analysis/howToCacheImage.html">
            
                    
                    如何实现缓存机制
            
                </a>
            

            
        </li>
    
        <li class="chapter " data-level="1.3.2.4" data-path="core/analysis/designPattern.html">
            
                <a href="core/analysis/designPattern.html">
            
                    
                    运用了哪些设计模式
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.4" data-path="introduction/认识cornerstone.md">
            
                <span>
            
                    
                    Conerstone Tools
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.4.1" data-path="tools/continue.html">
            
                <a href="tools/continue.html">
            
                    
                    待写
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    
        <li class="chapter " data-level="1.5" data-path="introduction/认识cornerstone.md">
            
                <span>
            
                    
                    Conerstone Image Loader
            
                </a>
            

            
            <ul class="articles">
                
    
        <li class="chapter " data-level="1.5.1" data-path="imageLoader/continue.html">
            
                <a href="imageLoader/continue.html">
            
                    
                    待写
            
                </a>
            

            
        </li>
    

            </ul>
            
        </li>
    

    

    <li class="divider"></li>

    <li>
        <a href="https://www.gitbook.com" target="blank" class="gitbook-link">
            本书使用 GitBook 发布
        </a>
    </li>
</ul>


                </nav>
            
        
    </div>

    <div class="book-body">
        
            <div class="body-inner">
                
                    

<div class="book-header" role="navigation">
    

    <!-- Title -->
    <h1>
        <i class="fa fa-circle-o-notch fa-spin"></i>
        <a href="." >前言</a>
    </h1>
</div>




                    <div class="page-wrapper" tabindex="-1" role="main">
                        <div class="page-inner">
                            
<div id="book-search-results">
    <div class="search-noresults">
    
                                <section class="normal markdown-section">
                                
                                <h1 id="&#x524D;&#x8A00;">&#x524D;&#x8A00;</h1>
<p>&#x8EAB;&#x4E3A;&#x4E00;&#x540D;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x8005;&#xFF0C;&#x65F6;&#x5E38;&#x4F1A;&#x542C;&#x5230;&#x5708;&#x5185;&#x7684;&#x670B;&#x53CB;&#x62B1;&#x6028;&quot;&#x5B66;&#x4E0D;&#x52A8;&#x4E86;&quot;&#x3002;&#x786E;&#x5B9E;&#x5982;&#x6B64;&#xFF0C;&#x524D;&#x7AEF;&#x6280;&#x672F;&#x7684;&#x6A2A;&#x5411;&#x53D1;&#x5C55;&#x548C;&#x8FED;&#x4EE3;&#x901F;&#x5EA6;&#x5B9E;&#x5728;&#x662F;&#x592A;&#x5FEB;&#x4E86;&#xFF0C;&#x7136;&#x800C;&#x4EBA;&#x7684;&#x7CBE;&#x529B;&#x5374;&#x662F;&#x6709;&#x9650;&#x7684;&#xFF0C;&#x5728;&#x4E2D;&#x9AD8;&#x7EA7;&#x7684;&#x6280;&#x672F;&#x8FDB;&#x9636;&#x9636;&#x6BB5;&#xFF0C;&#x5E7F;&#x6492;&#x7F51;&#x5F0F;&#x7684;&#x5B66;&#x4E60;&#x65B9;&#x5F0F;&#x5F80;&#x5F80;&#x4F1A;&#x9002;&#x5F97;&#x5176;&#x53CD;&#x3002;&#x90A3;&#x4E9B;&#x8C03;&#x4F83;&#x7A0B;&#x5E8F;&#x5458;&#x7684;&#x4E2D;&#x5E74;&#x5371;&#x673A;&#x7684;&#x6BB5;&#x5B50;&#xFF0C;&#x8BF4;&#x4E0D;&#x597D;&#x54EA;&#x5929;&#x771F;&#x7684;&#x53D8;&#x6210;&#x4E86;&#x73B0;&#x5B9E;&#xFF0C;&#x90A3;&#x4E48;&#x524D;&#x7AEF;er&#x5230;&#x5E95;&#x8BE5;&#x5982;&#x4F55;&#x6784;&#x5EFA;&#x81EA;&#x5DF1;&#x7684;&#x6280;&#x672F;&#x62A4;&#x57CE;&#x6CB3;&#xFF1F;</p>
<p>&#x5C31;&#x76EE;&#x524D;&#x770B;&#x6765;&#xFF0C;&#x524D;&#x7AEF;&#x53D1;&#x5C55;&#x7684;&#x4E3B;&#x8981;&#x9886;&#x57DF;&#x96C6;&#x4E2D;&#x5728;&#xFF1A;&#x5DE5;&#x7A0B;&#x5316;&#x3001;&#x97F3;&#x89C6;&#x9891;&#x5904;&#x7406;&#x3001;&#x670D;&#x52A1;&#x7AEF;&#xFF08;&#x4E2D;&#x95F4;&#x5C42;&#x6216;&#x670D;&#x52A1;&#x7AEF;&#x6E32;&#x67D3;&#xFF09;&#x3001;&#x591A;&#x7AEF;&#x5316;&#xFF08;&#x5C0F;&#x7A0B;&#x5E8F;&#xFF0C;RN&#x7B49;&#xFF09;&#x3001;&#x4EE5;&#x53CA;&#x672C;&#x6587;&#x5373;&#x5C06;&#x4ECB;&#x7ECD;&#x7684;&#x56FE;&#x5F62;&#x56FE;&#x50CF;&#x5904;&#x7406;&#x3002;&#x9009;&#x62E9;&#x4E00;&#x4E2A;&#x7EC6;&#x5206;&#x9886;&#x57DF;&#x8FDB;&#x884C;&#x805A;&#x7126;&#xFF0C;&#x6301;&#x7EED;&#x6DF1;&#x5165;&#x7684;&#x8015;&#x8018;, &#x6216;&#x8BB8;&#x662F;&#x4E2A;&#x4E0D;&#x9519;&#x7684;&#x5E94;&#x5BF9;&#x4E4B;&#x7B56;&#x3002;</p>
<p>&#x8BF4;&#x8D77;&#x56FE;&#x5F62;&#x56FE;&#x50CF;&#x5904;&#x7406;&#xFF0C;&#x5927;&#x5BB6;&#x5F88;&#x5BB9;&#x6613;&#x8054;&#x60F3;&#x5230;canvas&#x5B9E;&#x73B0;&#x7684;&#x6570;&#x636E;&#x53EF;&#x89C6;&#x5316;&#x6216;&#x52A8;&#x753B;&#x7279;&#x6548;&#x3001;openGL&#x6216;webGL&#x5B9E;&#x73B0;&#x7684;&#x4E09;&#x7EF4;&#x6A21;&#x578B;&#x7B49;&#x3002;&#x4ECE;2015&#x5E74;&#x5F00;&#x59CB;&#xFF0C;&#x5728;AI&#x7B97;&#x6CD5;&#x548C;&#x6846;&#x67B6;&#x7684;&#x5F15;&#x7206;&#x4E0B;&#xFF0C;&#x4EBA;&#x8138;&#x8BC6;&#x522B;&#x7B49;&#x9886;&#x57DF;&#x7684;&#x5546;&#x4E1A;&#x5316;&#x5E94;&#x7528;&#x76F8;&#x7EE7;&#x843D;&#x5730;&#x3002;&#x4E0E;&#x6B64;&#x540C;&#x65F6;&#xFF0C;&#x5728;&#x533B;&#x7597;&#x9886;&#x57DF;&#x540C;&#x6837;&#x4E5F;&#x6380;&#x8D77;&#x4E86;&#x4E00;&#x573A;&#x9769;&#x547D;&#xFF0C;&#x4EBA;&#x5DE5;&#x667A;&#x80FD;&#x501F;&#x52A9;&#x533B;&#x7597;&#x5F71;&#x50CF;&#x5927;&#x6570;&#x636E;&#x53CA;&#x56FE;&#x50CF;&#x8BC6;&#x522B;&#x6280;&#x672F;&#xFF0C;&#x5728;&#x80BA;&#x7ED3;&#x8282;&#x3001;&#x773C;&#x5E95;&#x3001;&#x4E73;&#x817A;&#x764C;&#x3001;&#x5BAB;&#x9888;&#x764C;&#x7B49;&#x65B9;&#x9762;&#x5DF2;&#x53D6;&#x5F97;&#x4E86;&#x8F83;&#x4E3A;&#x6210;&#x719F;&#x7684;&#x4EA7;&#x54C1;&#x3002;</p>
<p>AI&#x533B;&#x7597;&#x4E95;&#x55B7;&#x5F0F;&#x7684;&#x53D1;&#x5C55;&#x4F7F;&#x5F97;AI&#x7B97;&#x6CD5;&#x5DE5;&#x7A0B;&#x5E08;&#x7099;&#x624B;&#x53EF;&#x70ED;&#x5916;&#xFF0C;&#x533B;&#x7597;&#x8F6F;&#x4EF6;&#x7814;&#x53D1;&#x548C;&#x7CFB;&#x7EDF;&#x5DE5;&#x7A0B;&#x5E08;&#x4E5F;&#x6210;&#x4E3A;&#x4E86;&#x4E0B;&#x534A;&#x573A;&#x6700;&#x62A2;&#x624B;&#x7684;&#x4EBA;&#x624D;&#x3002;&#x539F;&#x56E0;&#x5728;&#x4E8E;:</p>
<blockquote>
<p>&#x8FD9;&#x91CC;&#x7684;&#x8F6F;&#x4EF6;&#x5DE5;&#x7A0B;&#x5E08;&#xFF0C;&#x5F80;&#x5F80;&#x8981;&#x6C42;&#x662F;&#x5177;&#x5907;&#x4E00;&#x5B9A;&#x533B;&#x7597;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7ECF;&#x9A8C;&#x7684;&#x3002;&#x653E;&#x5C04;&#x79D1;&#x68C0;&#x67E5;&#x6D41;&#x7A0B;&#x3001;&#x533B;&#x5B66;&#x5F71;&#x50CF;&#x57FA;&#x7840;&#x539F;&#x7406;&#x3001;DICOM&#x534F;&#x8BAE;&#xFF0C;&#x8FD9;&#x4E9B;&#x90FD;&#x8981;&#x591A;&#x5C11;&#x77E5;&#x9053;&#x4E00;&#x4E9B;&#x3002;&#x53E6;&#x5916;&#xFF0C;&#x5728;&#x4E00;&#x4E2A;&#x5546;&#x4E1A;&#x4EA7;&#x54C1;&#x5316;&#x7684;&#x533B;&#x7597;&#x5F71;&#x50CF;&#x5206;&#x6790;&#x8BCA;&#x65AD;&#x8F6F;&#x4EF6;&#x4E2D;&#xFF0C;AI&#x7B97;&#x6CD5;&#xFF08;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x6A21;&#x578B;&#xFF09;&#x5176;&#x5B9E;&#x53EA;&#x5360;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x7684;20~30%&#xFF0C;&#x6216;&#x66F4;&#x5C11;&#x3002;AI&#x7B97;&#x6CD5;&#x662F;&#x6574;&#x4E2A;&#x7CFB;&#x7EDF;&#x4E2D;&#x6280;&#x672F;&#x542B;&#x91CF;&#x6700;&#x9AD8;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x4F46;&#x7EDD;&#x5BF9;&#x4E0D;&#x662F;&#x5DE5;&#x4F5C;&#x91CF;&#x6700;&#x5927;&#x7684;&#x90E8;&#x5206;&#xFF0C;&#x4E5F;&#x4E0D;&#x662F;&#x7814;&#x53D1;&#x6295;&#x5165;&#x6700;&#x5927;&#x7684;&#x90E8;&#x5206;&#x3002;&#x73B0;&#x5728;&#x7684;&#x8F6F;&#x4EF6;&#x57FA;&#x672C;&#x90FD;&#x662F;&#x7F51;&#x7EDC;&#x5316;&#xFF0C;&#x4ECE;&#x670D;&#x52A1;&#x5668;&#x7AEF;&#xFF0C;&#x5230;&#x7F51;&#x9875;&#x7AEF;&#x6216;&#x5BA2;&#x6237;&#x7AEF;&#xFF0C;&#x5FC5;&#x7136;&#x5305;&#x542B;UI&#x3001;&#x901A;&#x8BAF;&#x3001;&#x6570;&#x636E;&#x5E93;&#x3001;&#x5B58;&#x50A8;&#x7B49;&#x4E00;&#x7CFB;&#x5217;&#x5FC5;&#x987B;&#x5F00;&#x53D1;&#x7684;&#x7EC4;&#x4EF6;&#x6216;&#x57FA;&#x7840;&#x67B6;&#x6784;&#x3002;&#x8FD9;&#x4E9B;&#x7EC4;&#x4EF6;&#x7684;&#x5F00;&#x53D1;&#x5F80;&#x5F80;&#x8981;&#x6574;&#x4E2A;&#x8F6F;&#x4EF6;&#x7CFB;&#x7EDF;&#x7684;70%&#x6216;&#x66F4;&#x591A;&#x3002;&#x8FD9;&#x91CC;&#xFF0C;&#x8FD8;&#x6CA1;&#x6709;&#x5305;&#x62EC;&#x6301;&#x7EED;&#x53D1;&#x5E03;&#x3001;&#x81EA;&#x52A8;&#x5316;&#x6D4B;&#x8BD5;&#x3001;&#x5B89;&#x88C5;&#x5305;&#x7B49;&#x8F85;&#x52A9;&#x57FA;&#x7840;&#x8BBE;&#x65BD;&#x7684;&#x642D;&#x5EFA;&#x3002;&#x6240;&#x4EE5;&#xFF0C;&#x73B0;&#x5728;&#x51E0;&#x4E4E;&#x6BCF;&#x4E2A;AI&#x516C;&#x53F8;&#x90FD;&#x5DF2;&#x7ECF;&#x6210;&#x7ACB;&#x4E86;&#x4E13;&#x95E8;&#x7684;&#x8F6F;&#x4EF6;&#x7EC4;&#xFF08;&#x90E8;&#xFF09;---<a href="https://zhuanlan.zhihu.com/p/52621172" target="_blank">&#x300A;&#x533B;&#x7597;&#x5F71;&#x50CF;AI&#x4E0B;&#x534A;&#x573A;&#xFF0C;&#x4EC0;&#x4E48;&#x4EBA;&#x624D;&#x6700;&#x62A2;&#x624B;&#xFF1F;&#x300B;</a></p>
</blockquote>
<p><img src="assets/images/timg.jpeg" alt="image"> </p>
<p>( &#x56FE;&#x7247;&#x6765;&#x6E90;&#x4E8E;&#x7F51;&#x7EDC;&#xFF0C;&#x5982;&#x6709;&#x4FB5;&#x6743;&#xFF0C;&#x8BF7;&#x8054;&#x7CFB;&#x5220;&#x9664;&#xFF01;)</p>
<blockquote>
<p>&#x6B63;&#x662F;&#x501F;&#x52A9;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#xFF0C;&#x521D;&#x521B;AI&#x516C;&#x53F8;&#x624D;&#x80FD;&#x591F;&#x5FEB;&#x901F;&#x63A8;&#x51FA;&#x81EA;&#x5DF1;&#x7684;&#x8F6F;&#x4EF6;&#x4EA7;&#x54C1;&#xFF0C;&#x83B7;&#x5F97;&#x8FDB;&#x5165;&#x5E02;&#x573A;&#x8DD1;&#x9053;&#xFF0C;&#x53C2;&#x4E0E;&#x7ADE;&#x4E89;&#x7684;&#x673A;&#x4F1A;&#x3002;&#x8BF4;&#x7684;&#x76F4;&#x767D;&#x4E00;&#x4E9B;&#xFF0C;&#x5982;&#x679C;&#x6CA1;&#x6709;Tensor Flow&#x548C;PyTorch&#x8FD9;&#x6837;&#x7684;&#x6DF1;&#x5EA6;&#x5B66;&#x4E60;&#x5E93;&#xFF0C;&#x5F88;&#x591A;&#x516C;&#x53F8;&#x4E0D;&#x53EF;&#x80FD;&#x5728;&#x77ED;&#x77ED;1~2&#x5E74;&#x95F4;&#x63A8;&#x51FA;&#x81EA;&#x5DF1;&#x7684;&#x8F6F;&#x4EF6;&#x4EA7;&#x54C1;&#x3002;&#x8FD9;&#x91CC;&#x8FD8;&#x4E0D;&#x80FD;&#x5FFD;&#x89C6;Cornerstone&#x8FD9;&#x7C7B;&#x8F6F;&#x4EF6;&#x7684;&#x7ED9;&#x529B;&#x52A9;&#x653B;&#x3002;---<a href="https://zhuanlan.zhihu.com/p/80381961" target="_blank">&#x300A;&#x662F;&#x5DE8;&#x4EBA;&#x7684;&#x80A9;&#x8180;&#xFF0C;&#x8FD8;&#x662F;&#x957F;&#x6C5F;&#x91CC;&#x7684;&#x540E;&#x6D6A;&#x300B;</a></p>
</blockquote>
<p>&#x8FD9;&#x91CC;&#x6240;&#x63D0;&#x53CA;&#x7684;<a href="https://github.com/cornerstonejs/cornerstone" target="_blank">Cornerstone</a>, &#x662F;&#x4E00;&#x5957;&#x57FA;&#x4E8E;javascript&#x8BED;&#x8A00;&#x5B9E;&#x73B0;&#x7684;&#x533B;&#x7597;&#x5F71;&#x50CF;&#x5E93;&#x3002;&#x6B63;&#x5982;&#x5176;&#x540D;&quot;&#x57FA;&#x77F3;&quot;, &#x5B83;&#x7684;&#x8BDE;&#x751F;, &#x4F7F;&#x5F97;&#x5728;&#x6D4F;&#x89C8;&#x5668;&#x7684;web&#x4E0A;&#x663E;&#x793A;&#x9AD8;&#x6E05;&#x533B;&#x5B66;&#x5F71;&#x50CF;&#x6210;&#x4E3A;&#x53EF;&#x80FD;&#xFF0C;&#x8981;&#x77E5;&#x9053;&#x6B64;&#x524D;&#x7684;&#x8FD9;&#x7C7B;&#x5E94;&#x7528;&#x53EA;&#x80FD;&#x7531;&#x5F00;&#x53D1;&#x5BA2;&#x6237;&#x7AEF;&#x7684;C##&#x7B49;&#x8BED;&#x8A00;&#x624D;&#x80FD;&#x5B9E;&#x73B0;&#x3002;Cornerstone&#x9664;&#x4E86;&#x5904;&#x7406;&#x56FE;&#x50CF;&#x79FB;&#x52A8;&#x3001;&#x7F29;&#x653E;&#x3001;&#x65CB;&#x8F6C;&#x3001;&#x6807;&#x6CE8;&#x3001;&#x6D4B;&#x91CF;&#x3001;&#x6EE4;&#x955C;&#x3001;&#x56FE;&#x7247;&#x878D;&#x5408;&#x7B49;&#x57FA;&#x7840;&#x529F;&#x80FD;&#x5916;&#xFF0C;&#x8FD8;&#x63D0;&#x4F9B;&#x4E86;&#x533B;&#x5B66;&#x56FE;&#x50CF;&#x7279;&#x6709;&#x7684;&#x7A97;&#x5BBD;&#x7A97;&#x4F4D;&#x8C03;&#x6574;&#xFF0C;&#x501F;&#x52A9;&#x5176;&#x4ED6;&#x751F;&#x6001;&#x914D;&#x5957;&#x5E93;&#x8FD8;&#x53EF;&#x4EE5;&#x5B9E;&#x73B0;MPR(&#x591A;&#x5E73;&#x9762;&#x91CD;&#x5EFA;)&#x3002;</p>
<p>Cornerstone&#x5F00;&#x6E90;&#x5E93;&#x7684;&#x6838;&#x5FC3;&#x56E2;&#x961F;&#x4E3A;&#x4E86;&#x6253;&#x9020;Cornerstone&#x6700;&#x4F73;&#x5B9E;&#x8DF5;&#xFF0C;&#x540C;&#x65F6;&#x8FD8;&#x5F00;&#x6E90;&#x8D21;&#x732E;&#x4E86;&#x4E00;&#x4E2A;&#x533B;&#x7597;&#x9605;&#x7247;&#x7CFB;&#x7EDF;&#x9879;&#x76EE;<a href="https://viewer.ohif.org/" target="_blank">&#x300A;OHIF Viewer&#x300B;</a>&#xFF08;&#x754C;&#x9762;&#x89C1;&#x4E0B;&#x56FE;&#xFF09;&#x3002;</p>
<blockquote>
<p>&#x968F;&#x7740;Web&#x524D;&#x7AEF;&#x7B49;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x6280;&#x672F;&#x7684;&#x51FA;&#x73B0;&#xFF0C;&#x8F6F;&#x4EF6;&#x5F00;&#x53D1;&#x7684;&#x6574;&#x4F53;&#x8D8B;&#x52BF;&#x662F;&#x6210;&#x672C;&#x4E0B;&#x964D;&#x3001;&#x5468;&#x671F;&#x7F29;&#x77ED;&#x3002;&#x7C7B;&#x4F3C;&#x4E0A;&#x9762;&#x7684;&#x529F;&#x80FD;&#xFF0C;&#x4F20;&#x7EDF;&#x516C;&#x53F8;&#x65E9;&#x5E74;&#x53EF;&#x80FD;&#x8981;&#x7528;12&#x4EBA;&#x6708;&#x7684;&#x6210;&#x672C;&#x5F00;&#x53D1;&#x51FA;&#x6765;&#x3002;&#x4F46;&#x65B0;&#x5174;&#x516C;&#x53F8;&#x53EF;&#x80FD;&#x53EA;&#x9700;&#x8981;3&#x4EBA;&#x6708;&#x5C31;&#x53EF;&#x4EE5;&#x5F00;&#x53D1;&#x51FA;&#x6765;&#x3002;&#x800C;&#x4E14;&#x754C;&#x9762;&#x7F8E;&#x89C2;&#x548C;&#x65F6;&#x5C1A;&#x7A0B;&#x5EA6;&#xFF0C;&#x53EF;&#x80FD;&#x8FD8;&#x8981;&#x8FDC;&#x8D85;&#x73B0;&#x6709;&#x4F20;&#x7EDF;&#x4EA7;&#x54C1;&#x3002;&#x7B80;&#x5355;&#x6765;&#x8BF4;&#xFF0C;&#x62A4;&#x57CE;&#x6CB3;&#x4ECD;&#x7136;&#x5B58;&#x5728;&#xFF0C;&#x4F46;&#x4F20;&#x7EDF;&#x5382;&#x5BB6;&#x82B1;10&#x5E74;&#x6316;&#x7684;&#x62A4;&#x57CE;&#x6CB3;&#xFF0C;&#x65B0;&#x52BF;&#x529B;&#x501F;&#x52A9;&#x5F00;&#x6E90;&#x8F6F;&#x4EF6;&#x52A9;&#x653B;&#xFF0C;&#x82B1;1~2&#x5E74;&#x53EF;&#x80FD;&#x5C31;&#x53EF;&#x4EE5;&#x8DE8;&#x8D8A;&#x3002;---<a href="https://zhuanlan.zhihu.com/p/80381961" target="_blank">&#x300A;&#x662F;&#x5DE8;&#x4EBA;&#x7684;&#x80A9;&#x8180;&#xFF0C;&#x8FD8;&#x662F;&#x957F;&#x6C5F;&#x91CC;&#x7684;&#x540E;&#x6D6A;&#x300B;</a></p>
</blockquote>
<p>&#x4E3A;&#x4E86;&#x6DF1;&#x5165;&#x7406;&#x89E3;&#x5176;&#x539F;&#x7406;, &#x7B14;&#x8005;&#x76EE;&#x524D;&#x6B63;&#x5728;&#x7814;&#x7A76;Cornerstone&#x4EE5;&#x53CA;&#x76F8;&#x5173;&#x751F;&#x6001;&#x5E93;&#x7684;&#x6E90;&#x7801;&#xFF0C;&#x5F00;&#x53D1;&#x4E4B;&#x4F59;&#x5C06;&#x6E90;&#x7801;&#x89E3;&#x6790;&#x6574;&#x7406;&#x6210;&#x4E86;&#x7B14;&#x8BB0;<a href="https://harrychen0506.github.io/cornerstone-analysis/" target="_blank">&#x300A;Cornerstone&#x6E90;&#x7801;&#x89E3;&#x6790;&#x300B;</a>&#xFF0C;&#x672C;&#x7740;&#x5F00;&#x6E90;&#x7684;&#x7CBE;&#x795E;&#xFF0C;&#x4E5F;&#x5206;&#x4EAB;&#x7ED9;&#x5927;&#x5BB6;&#x3002;&#x7531;&#x4E8E;web&#x533B;&#x7597;&#x5F71;&#x50CF;&#x9886;&#x57DF;&#x504F;&#x5C0F;&#x4F17;&#x5316;&#xFF0C;&#x7F3A;&#x4E4F;&#x826F;&#x597D;&#x7684;&#x4EA4;&#x6D41;&#x5E73;&#x53F0;&#xFF0C;&#x6240;&#x4EE5;&#x7B14;&#x8005;&#x5728;&#x6587;&#x672B;&#x63D0;&#x4F9B;&#x4E00;&#x4E2A;QQ&#x7FA4;&#xFF0C;&#x5E0C;&#x671B;&#x5927;&#x5BB6;&#x53EF;&#x4EE5;&#x5728;&#x91CC;&#x9762;&#x76F8;&#x4E92;&#x4EA4;&#x6D41;&#xFF0C;&#x89E3;&#x51B3;&#x5B9E;&#x9645;&#x95EE;&#x9898;&#xFF0C;&#x8FD9;&#x4E5F;&#x662F;&#x7B14;&#x8005;&#x60F3;&#x5199;&#x8FD9;&#x7BC7;&#x6587;&#x7AE0;&#x7684;&#x53E6;&#x4E00;&#x4E2A;&#x76EE;&#x7684;&#x3002;</p>
<table>
<thead>
<tr>
<th>QQ&#x7FA4; &#xFF08;813051150&#xFF09;</th>
<th>&#x516C;&#x4F17;&#x53F7;</th>
</tr>
</thead>
<tbody>
<tr>
<td><img src="assets/images/qq.jpg" alt="image"></td>
<td><img src="assets/images/gzh.png" alt="image"></td>
</tr>
</tbody>
</table>
<h3 id="&#x76F8;&#x5173;&#x94FE;&#x63A5;">&#x76F8;&#x5173;&#x94FE;&#x63A5;</h3>
<ul>
<li><a href="https://zhuanlan.zhihu.com/p/58767457" target="_blank">&#x300A;&#x4ECE;Cornerstone&#x5230;OHIF Viewer&#x2014;JS&#x5F71;&#x50CF;&#x524D;&#x7AEF;&#x5F00;&#x53D1;&#x6700;&#x4F73;&#x8303;&#x4F8B;&#x300B;</a></li>
<li><a href="https://zhuanlan.zhihu.com/p/80381961" target="_blank">&#x300A;&#x662F;&#x5DE8;&#x4EBA;&#x7684;&#x80A9;&#x8180;&#xFF0C;&#x8FD8;&#x662F;&#x957F;&#x6C5F;&#x91CC;&#x7684;&#x540E;&#x6D6A;&#x300B;</a></li>
<li><a href="https://zhuanlan.zhihu.com/p/52621172" target="_blank">&#x300A;&#x533B;&#x7597;&#x5F71;&#x50CF;AI&#x4E0B;&#x534A;&#x573A;&#xFF0C;&#x4EC0;&#x4E48;&#x4EBA;&#x624D;&#x6700;&#x62A2;&#x624B;&#xFF1F;&#x300B;</a></li>
<li><a href="https://harrychen0506.github.io/cornerstone-analysis/" target="_blank">&#x300A;Cornerstone&#x6E90;&#x7801;&#x89E3;&#x6790;&#x300B;</a></li>
</ul>

                                
                                </section>
                            
    </div>
    <div class="search-results">
        <div class="has-results">
            
            <h1 class="search-results-title"><span class='search-results-count'></span> results matching "<span class='search-query'></span>"</h1>
            <ul class="search-results-list"></ul>
            
        </div>
        <div class="no-results">
            
            <h1 class="search-results-title">No results matching "<span class='search-query'></span>"</h1>
            
        </div>
    </div>
</div>

                        </div>
                    </div>
                
            </div>

            
                
                
                <a href="introduction/" class="navigation navigation-next navigation-unique" aria-label="Next page: 总览">
                    <i class="fa fa-angle-right"></i>
                </a>
                
            
        
    </div>

    <script>
        var gitbook = gitbook || [];
        gitbook.push(function() {
            gitbook.page.hasChanged({"page":{"title":"前言","level":"1.1","depth":1,"next":{"title":"总览","level":"1.2","depth":1,"path":"introduction/index.md","ref":"introduction/index.md","articles":[]},"dir":"ltr"},"config":{"plugins":["github","livereload","livereload"],"styles":{"website":"./styles/website.css"},"pluginsConfig":{"github":{"url":"https://github.com/HarryChen0506/cornerstone-analysis.git"},"livereload":{},"search":{},"lunr":{"maxIndexSize":1000000,"ignoreSpecialCharacters":false},"donate":{"alipay":"./source/images/donate.png","title":"","button":"赞赏","alipayText":" "},"fontsettings":{"theme":"white","family":"sans","size":2},"highlight":{},"anchor-navigation-ex":{"showLevel":false},"favicon":{"shortcut":"./source/images/favicon.jpg","bookmark":"./source/images/favicon.jpg","appleTouch":"./source/images/apple-touch-icon.jpg","appleTouchMore":{"120x120":"./source/images/apple-touch-icon.jpg","180x180":"./source/images/apple-touch-icon.jpg"}},"github-buttons":{"buttons":[{"user":"HarryChen0506","repo":"cornerstone-analysis","type":"star","size":"small","count":true}]},"sharing":{"facebook":false,"twitter":false,"google":false,"weibo":false,"instapaper":false,"vk":false,"all":["facebook","google","twitter","weibo","instapaper"]},"theme-default":{"styles":{"website":"styles/website.css","pdf":"styles/pdf.css","epub":"styles/epub.css","mobi":"styles/mobi.css","ebook":"styles/ebook.css","print":"styles/print.css"},"showLevel":false}},"theme":"default","author":"HarryChen","pdf":{"pageNumbers":true,"fontSize":12,"fontFamily":"Arial","paperSize":"a4","chapterMark":"pagebreak","pageBreaksBefore":"/","margin":{"right":62,"left":62,"top":56,"bottom":56}},"structure":{"langs":"LANGS.md","readme":"README.md","glossary":"GLOSSARY.md","summary":"SUMMARY.md"},"variables":{},"title":"Cornerstone源码解析","language":"zh-hans","links":{"sharing":{"facebook":false,"twitter":false}},"gitbook":"*","description":"cornerstone及其生态库介绍和源码解析"},"file":{"path":"README.md","mtime":"2019-10-26T02:51:19.576Z","type":"markdown"},"gitbook":{"version":"3.2.3","time":"2019-10-26T03:52:25.066Z"},"basePath":".","book":{"language":""}});
        });
    </script>
</div>

        
    <script src="gitbook/gitbook.js"></script>
    <script src="gitbook/theme.js"></script>
    
        
        <script src="gitbook/gitbook-plugin-github/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-livereload/plugin.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search-engine.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-search/search.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/lunr.min.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-lunr/search-lunr.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-sharing/buttons.js"></script>
        
    
        
        <script src="gitbook/gitbook-plugin-fontsettings/fontsettings.js"></script>
        
    

    </body>
</html>

